
## Plan Result (terraform/shared)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10859994707)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.ecr
  * aws_iam_role.ecr
  * aws_iam_role_policy_attachment.ecr


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.ecr will be created
  + resource "aws_iam_policy" "ecr" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "All_In_Backend_API_CI_Policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-1:451153100141:repository/all_in_api"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.ecr will be created
  + resource "aws_iam_role" "ecr" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:team-all-in/all-in:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::451153100141:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "All_In_Backend_API_CI"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr will be created
  + resource "aws_iam_role_policy_attachment" "ecr" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "All_In_Backend_API_CI"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":49,"Program":"tfcmt","SHA1":"a0a0d29587dc4711d8c13ba7506b66ef066338bf","Target":"terraform/shared","Vars":{},"WorkflowName":"pull_request_target"} -->